; domain
(define (domain gripper-strips)
  (:types room ball gripper)

   (:predicates (at-robby ?r - room)
		(at ?b - ball ?r - room)
		(free ?g - gripper)
		(carry ?b - ball ?g - gripper))

   (:action move
       :parameters  (?o1 ?o2 - room)
       :precondition (and (at-robby ?o1))
       :effect (and  (at-robby ?o2)
		     (not (at-robby ?o1))))



   (:action pick
       :parameters (?o1 - ball ?o2 - room ?o3 - gripper)
       :precondition  (and  (at ?o1 ?o2) (at-robby ?o2) (free ?o3))
       :effect (and (carry ?o1 ?o3)
		    (not (at ?o1 ?o2)) 
		    (not (free ?o3))))


   (:action drop
       :parameters (?o1 - ball ?o2 - room ?o3 - gripper)
       :precondition  (and  (carry ?o1 ?o3) (at-robby ?o2))
       :effect (and (at ?o1 ?o2)
		    (free ?o3)
		    (not (carry ?o1 ?o3)))))

; problem
(define (problem strips-gripper-x-3)
  (:domain gripper-strips)
  (:objects ball7 -  ball ball8 -  ball roomb -  room rooma -  room ball6 -  ball ball5 -  ball ball4 -  ball ball3 -  ball ball2 -  ball ball1 -  ball left -  gripper right -  gripper )
  (:init (at ball8 rooma) (at ball6 rooma) (at ball5 rooma) (at ball2 rooma) (at ball3 rooma) (free right) (at ball7 rooma) (at ball4 rooma) (free left) (at ball1 rooma) (at-robby roomb) )
  (:goal (and (at ball6 rooma)(at ball5 rooma)(at ball2 rooma)(at ball3 rooma)(at ball4 rooma)(at ball1 rooma)(carry ball8 left)(at-robby roomb)(at ball7 roomb)(free right)(not (at-robby rooma))(not (at ball8 rooma))(not (at ball8 roomb))(not (at ball7 rooma))(not (at ball6 roomb))(not (at ball5 roomb))(not (at ball4 roomb))(not (at ball3 roomb))(not (at ball2 roomb))(not (at ball1 roomb))(not (free left))(not (carry ball8 right))(not (carry ball7 left))(not (carry ball7 right))(not (carry ball6 left))(not (carry ball6 right))(not (carry ball5 left))(not (carry ball5 right))(not (carry ball4 left))(not (carry ball4 right))(not (carry ball3 left))(not (carry ball3 right))(not (carry ball2 left))(not (carry ball2 right))(not (carry ball1 left))(not (carry ball1 right)))))

; plan
1. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 29 of 36
2. (pick ball7 rooma right)
   deleted: (at ball7 rooma) (free right)
   added: (carry ball7 right)
   goals met: 28 of 36
3. (pick ball8 rooma left)
   deleted: (at ball8 rooma) (free left)
   added: (carry ball8 left)
   goals met: 31 of 36
4. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 33 of 36
5. (drop ball7 roomb right)
   deleted: (carry ball7 right)
   added: (at ball7 roomb) (free right)
   goals met: 36 of 36
